app/controllers/web/pages_controller.rb

  def load_account_details
    @devices = current_user.devices.order(last_seen_at: :desc, created_at: :desc)
    @latest_subscription = current_user.display_subscription(provider: BillingCustomer::PROVIDER_STRIPE)
    @desktop_checkout_handoff_url = "voxlane://billing/refresh" if params[:checkout] == "success" &&
      @latest_subscription&.grants_access? &&
      @devices.any?
---
SELECT "subscriptions".* FROM "subscriptions" WHERE "subscriptions"."user_id" = $1  [["user_id", 28]]