app/models/user.rb

SELECT "entitlements".* FROM "entitlements" WHERE "entitlements"."user_id" = $1 AND "entitlements"."key" = $2 LIMIT $3  [["user_id", 1], ["key", "pro"], ["LIMIT", 1]]
---
  def current_entitlement
    entitlements.find_by(key: AppConfig.entitlement_key)