app/controllers/api/v1/app/devices_controller.rb

SELECT "devices".* FROM "devices" WHERE "devices"."user_id" = $1 AND "devices"."device_identifier" = $2 LIMIT $3  [["user_id", 3], ["device_identifier", "device-abc"], ["LIMIT", 1]]
---
  def create
    device = current_user.devices.find_or_initialize_by(device_identifier: device_params[:device_identifier])