app/views/web/pages/account.html.erb

INSERT INTO "users" ("supabase_uid", "email", "display_name", "last_seen_at", "profile", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
          <span class="meta-card__label">Member since</span>
          <span class="meta-card__value"><%= format_date.call(current_user.created_at) %></span>