app/services/entitlements/reconciler.rb

    def call
      entitlement = user.entitlements.find_or_initialize_by(key: AppConfig.entitlement_key)
      attributes = active_subscription.present? ? subscription_attributes : trial_attributes

      entitlement.assign_attributes(attributes.merge(last_synced_at: Time.current))
      entitlement.save!
---
SELECT "entitlements".* FROM "entitlements" WHERE "entitlements"."user_id" = $1 AND "entitlements"."key" = $2 LIMIT $3  [["user_id", 1], ["key", "pro"], ["LIMIT", 1]]
UPDATE "entitlements" SET "status" = $1, "source" = $2, "active_from" = $3, "active_until" = $4, "trial_ends_at" = $5, "last_synced_at" = $6, "metadata" = $7, "updated_at" = $8 WHERE "entitlements"."id" = $9

    def active_subscription
      @active_subscription ||= user.subscriptions
        .sort_by { |subscription| [subscription.current_period_end_at || Time.at(0), subscription.updated_at || Time.at(0)] }
        .reverse
        .find(&:grants_access?)
---
SELECT "subscriptions".* FROM "subscriptions" WHERE "subscriptions"."user_id" = $1  [["user_id", 1]]